stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_adc.c
  /* Get tick count */
  tickstart = HAL_GetTick();

  /* Wait until End of unitary conversion or sequence conversions flag is raised */
  while (__HAL_ADC_GET_FLAG(hadc, ADC_IRQ_FLAG_EODS) == 0UL)
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0UL))
      {
        /* Update ADC state machine to timeout */
        SET_BIT(hadc->State, HAL_ADC_STATE_TIMEOUT);

        /* Process unlocked */
        __HAL_UNLOCK(hadc);

        return HAL_TIMEOUT;
      }
    }
  }

  /* Update ADC state machine */
  SET_BIT(hadc->State, HAL_ADC_STATE_DS_EOC);

  /* Check whether end of sequence is reached */
  if (__HAL_ADC_GET_FLAG(hadc, ADC_IRQ_FLAG_EOS))
  {
    /* Set ADC state */
    CLEAR_BIT(hadc->State, HAL_ADC_STATE_DS_BUSY);
  }

  /* Clear polled flag */
  __HAL_ADC_CLEAR_FLAG(hadc, (ADC_IRQ_FLAG_EODS | ADC_IRQ_FLAG_EOS));

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Poll for ADC event.
  * @param hadc ADC handle
  * @param EventType the ADC event type.
  *          This parameter can be one of the following values:
  *          ADC_IRQ_FLAG_OVRFL   ADC decimation filter saturated event (1)
  *          ADC_IRQ_FLAG_OVRDF   ADC decimation filter overrun event (1)
  *          ADC_IRQ_FLAG_EODF    ADC decimation filter conversion completed event (1)
  *          ADC_IRQ_FLAG_OVRDS   ADC Down Sampler overrun event
  *          ADC_IRQ_FLAG_AWD1     ADC analog watchdog event
  *          ADC_IRQ_FLAG_EOS     ADC sequence of conversion completed event
  *          ADC_IRQ_FLAG_EODS    ADC Down Sampler conversion completed Event
  *         (1) todo: Only available on STM32WB0x
  * @param Timeout Timeout value in millisecond.
  * @note   The relevant flag is cleared if found to be set, except for
  *         ADC_IRQ_FLAG_OVRDS.
  *         Indeed, the latter is reset only if hadc->Init.Overrun field is set
  *         to ADC_NEW_DATA_IS_KEPT. Otherwise, data register may be
  *         potentially overwritten by a new converted data as soon as OVR is
  *         cleared.
  *         To reset OVR flag once the preserved data is retrieved, the user can
  *         resort to macro __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAG_OVRDS);
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_PollForEvent(ADC_HandleTypeDef *hadc, uint32_t EventType, uint32_t Timeout)
{
  uint32_t tickstart;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_EVENT_TYPE(EventType));

  /* Get tick count */
  tickstart = HAL_GetTick();

  /* Check selected event flag */
  while (__HAL_ADC_GET_FLAG(hadc, EventType) == 0UL)
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if (Timeout != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0UL))
      {
        /* Update ADC state machine to timeout */
        SET_BIT(hadc->State, HAL_ADC_STATE_TIMEOUT);

        /* Process unlocked */
        __HAL_UNLOCK(hadc);

        return HAL_TIMEOUT;
      }
    }
  }

  switch (EventType)
  {

    /* Check analog watchdog flag */
    case ADC_IRQ_FLAG_AWD1:
      /* Set ADC state */
      SET_BIT(hadc->State, HAL_ADC_STATE_AWD1);

      /* Clear ADC analog watchdog flag */
      __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAG_AWD1);

      break;

    /* Check sequence of conversion completed flag */
    case ADC_IRQ_FLAG_EOS:
      /* Set ADC state */
      SET_BIT(hadc->State, HAL_ADC_STATE_DS_EOC);

      /* Clear ADC sequence of conversion completed flag */
      __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAG_EOS);

      break;

    /* Check Down Sampler conversion completed flag */
    case ADC_IRQ_FLAG_EODS:
      /* Set ADC state */
      SET_BIT(hadc->State, HAL_ADC_STATE_DS_EOC);

      /* Clear ADC Down Sampler conversion completed flag */
      __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAG_EODS);

      break;

    /* Overrun event */
    default: /* Case ADC_OVR_EVENT */
      /* If overrun is set to overwrite previous data, overrun event is not     */
      /* considered as an error.                                                */
      if (hadc->Init.Overrun == ADC_NEW_DATA_IS_LOST)
      {
        /* Set ADC state */
        SET_BIT(hadc->State, HAL_ADC_STATE_DS_OVR);

        /* Set ADC error code to overrun */
        SET_BIT(hadc->ErrorCode, HAL_ADC_ERROR_OVR);
      }
      else
      {
        /* Clear ADC Overrun flag only if Overrun is set to ADC_NEW_DATA_IS_KEPT
          otherwise, data register is potentially overwritten by new converted data as soon
          as OVR is cleared. */
        __HAL_ADC_CLEAR_FLAG(hadc, ADC_IRQ_FLAG_OVRDS);
      }
      break;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Enable ADC and start conversion with interruption.
  * @note   Interruptions enabled in this function according to initialization
  *         setting : EOC (end of conversion), EOS (end of sequence),
  *         OVR overrun.
  *         Each of these interruptions has its dedicated callback function.
  * @note   To guarantee a proper reset of all interruptions once all the needed
  *         conversions are obtained, HAL_ADC_Stop_IT() must be called to ensure
  *         a correct stop of the IT-based conversions.
  * @param hadc ADC handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_Start_IT(ADC_HandleTypeDef *hadc)
{
  HAL_StatusTypeDef tmp_hal_status;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Process locked */
  __HAL_LOCK(hadc);

  /* Enable the ADC peripheral */
  tmp_hal_status = ADC_Enable(hadc);

  /* Start conversion if ADC is effectively enabled */
  if (tmp_hal_status == HAL_OK)
  {
    /* Set ADC state                                                        */
    /* - Clear state bitfield related to conversion results   */
    /* - Set state bitfield related to operation                    */
    ADC_STATE_CLR_SET(hadc->State,
                      HAL_ADC_STATE_READY | HAL_ADC_STATE_DS_EOC | HAL_ADC_STATE_DS_OVR,
                      HAL_ADC_STATE_DS_BUSY);

    /* Reset all ADC error code fields */
    ADC_CLEAR_ERRORCODE(hadc);

    /* Clear ADC conversion flag and overrun flag               */
    /* (To ensure of no unknown state from potential previous ADC operations) */
    __HAL_ADC_CLEAR_FLAG(hadc, (ADC_IRQ_FLAG_EODS | ADC_IRQ_FLAG_EOS | ADC_IRQ_FLAG_OVRDS));

