stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Src/stm32wl3x_hal_adc.c
    tmp_hal_status = HAL_ERROR;
  }

  if (sConfigChannel->CalibrationPoint.Number != ADC_CALIB_NONE)
  {
    if (sConfigChannel->CalibrationPoint.Gain != 0UL)
    {
      tmp_gain = sConfigChannel->CalibrationPoint.Gain;
    }
    else if ((sConfigChannel->VoltRange == ADC_VIN_RANGE_1V2)
             || (sConfigChannel->Channel == ADC_CHANNEL_TEMPSENSOR))
    {
      /* 1.2V mode: [calibrated gain = 0.96, gain clamped at 1] */
      tmp_gain = 0xFFFUL;
    }
    else if (sConfigChannel->VoltRange == ADC_VIN_RANGE_2V4)
    {
      /* 2.4V mode: [calibrated gain = 1/2] */
      tmp_gain = 0x7FFUL;
    }
    else /* ADC_VIN_RANGE_3V6 */
    {
      /* 3.6V mode: [calibrated gain = 1/3] */
      tmp_gain = 0x555UL;
    }
    LL_ADC_ConfigureCalibPoint(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                               tmp_gain, sConfigChannel->CalibrationPoint.Offset);

    switch (sConfigChannel->Channel)
    {
      case ADC_CHANNEL_VINM0:
      case ADC_CHANNEL_VINM1:
      case ADC_CHANNEL_VINM2:
      case ADC_CHANNEL_VINM3:
      {
        LL_ADC_SetCalibPointForSingleNeg(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                                         sConfigChannel->VoltRange);
        break;
      }
      case ADC_CHANNEL_VINP0:
      case ADC_CHANNEL_VINP1:
      case ADC_CHANNEL_VINP2:
      case ADC_CHANNEL_VINP3:
      {
        LL_ADC_SetCalibPointForSinglePos(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                                         sConfigChannel->VoltRange);
        break;
      }
      case ADC_CHANNEL_VINP0_VINM0:
      case ADC_CHANNEL_VINP1_VINM1:
      case ADC_CHANNEL_VINP2_VINM2:
      case ADC_CHANNEL_VINP3_VINM3:
      {
        LL_ADC_SetCalibPointForDiff(hadc->Instance, sConfigChannel->CalibrationPoint.Number, sConfigChannel->VoltRange);
        break;
      }
      case ADC_CHANNEL_VBAT:
      {
        LL_ADC_SetCalibPointForSingleNeg(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                                         LL_ADC_VIN_RANGE_3V6);
        break;
      }
      case ADC_CHANNEL_TEMPSENSOR:
      {
        LL_ADC_SetCalibPointForSinglePos(hadc->Instance, sConfigChannel->CalibrationPoint.Number,
                                         LL_ADC_VIN_RANGE_1V2);
        break;
      }
      default:
      {
        /* Update ADC state machine to error */
        SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

        tmp_hal_status = HAL_ERROR;
        break;
      }
    }
  }
  else
  {
    /* Nothing to do */
    __NOP();
  }

  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}


/**
  * @brief  Configure the watchdog.
  * @note   Possibility to update parameters on the fly:
  *         This function initializes the watchdog, successive
  *         calls to this function can be used to reconfigure some parameters
  *         of structure "ADC_AnalogWDGConfTypeDef" on the fly, without
  *         resetting the ADC.
  *         The setting of these parameters is conditioned to ADC state.
  * @param hadc ADC handle
  * @param ConfigWatchdog Structure of ADC watchdog configuration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ADC_AnalogWDGConfig(ADC_HandleTypeDef *hadc, const ADC_AnalogWDGConfTypeDef *ConfigWatchdog)
{
  HAL_StatusTypeDef tmp_hal_status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));
  assert_param(IS_ADC_AWD_CHANNEL(ConfigWatchdog->ChannelMask));
  assert_param(IS_ADC_AWD_EVENT_TYPE(ConfigWatchdog->EventType));

  /* Process locked */
  __HAL_LOCK(hadc);

  /* Check if there is a conversion on going */
  if (LL_ADC_IsConversionOngoing(hadc->Instance) == 0UL)
  {
    /* Configure the thresholds */
    LL_ADC_ConfigureAWDThresholds(hadc->Instance, ConfigWatchdog->LowThreshold, ConfigWatchdog->HighThreshold);

    /* Set the channels mask */
    LL_ADC_SetAWDInputChannels(hadc->Instance, ConfigWatchdog->ChannelMask);

    /* Update state, clear previous result related to watchdog */
    CLEAR_BIT(hadc->State, HAL_ADC_STATE_AWD1);

    /* Clear flag ADC analog watchdog */
    /* Note: Flag cleared Clear the ADC Analog watchdog flag to be ready  */
    /* to use for HAL_ADC_IRQHandler() or HAL_ADC_PollForEvent()          */
    /* (in case left enabled by previous ADC operations).                 */
    LL_ADC_ClearFlag_AWD(hadc->Instance);

    /* Configure ADC analog watchdog interrupt */
    if (ConfigWatchdog->EventType == ADC_AWD_EVENT_INTERRUPT)
    {
      LL_ADC_EnableIT_AWD(hadc->Instance);
    }
    else
    {
      LL_ADC_DisableIT_AWD(hadc->Instance);
    }
  }
  /* If a conversion is on going , no update could be done */
  else
  {
    /* Update ADC state machine to error */
    SET_BIT(hadc->State, HAL_ADC_STATE_ERROR_CONFIG);

    tmp_hal_status = HAL_ERROR;
  }
  /* Process unlocked */
  __HAL_UNLOCK(hadc);

  /* Return function status */
  return tmp_hal_status;
}

/**
  * @}
  */

/** @defgroup ADC_Exported_Functions_Group7 Peripheral State functions
  * @brief    ADC Peripheral State functions
  *
@verbatim
 ===============================================================================
            ##### Peripheral state and errors functions #####
 ===============================================================================
    [..]
    This subsection provides functions to get in run-time the status of the
    peripheral.
      (+) Check the ADC state
      (+) Check the ADC error code

@endverbatim
  * @{
  */

/**
  * @brief  Return the ADC handle state.
  * @note   ADC state machine is managed by bitfields, ADC status must be
  *         compared with states bits.
  *         For example:
  *           " if ((HAL_ADC_GetState(hadc) & HAL_ADC_STATE_DS_BUSY) != 0UL) "
  *           " if ((HAL_ADC_GetState(hadc) & HAL_ADC_STATE_AWD1) != 0UL) "
  * @param hadc ADC handle
  * @retval ADC handle state (bitfield on 32 bits)
  */
uint32_t HAL_ADC_GetState(const ADC_HandleTypeDef *hadc)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  /* Return ADC handle state */
  return hadc->State;
}

/**
  * @brief  Return the ADC error code.
  * @param hadc ADC handle
  * @retval ADC error code (bitfield on 32 bits)
  */
uint32_t HAL_ADC_GetError(const ADC_HandleTypeDef *hadc)
{
  /* Check the parameters */
  assert_param(IS_ADC_ALL_INSTANCE(hadc->Instance));

  return hadc->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

